{
  "designContent": [
    {
      "title": "Wireframes",
      "explanation": "I have Designed Wireframes for both laptop and phone screens .In the images below please note that the text in red is the Visual design element, the green is the Visual Response, and the blue is the Interaction points. These help breakdown the website and its various elements. ",
      "part1": {
        "title": "Website Wireframes",
        "description": "For the Home page, I have slightly varying layouts per section.  The homepage has a video on the top then it has “cards” which are links to blog pages. These blog pages are articles about sea life and how to conserve it. After that is the About Us section which is text not in a bordered box and there is a section called “This is why we care” where pollution statistics are shown. This section has a border. This website aims to educate sections that are text that aims to educate or inform have a border. Thus, the Theory pages, quiz and design section have borders around the information. ",
        "description2": "The images on this site have a grid layout (the pictures are next to each other) and when the screen is resized the images are one below each other.",
        "images": [
          {
            "src": "Home.png",
            "caption": "Home Page Wirframe"
          },
          {
            "src": "Home2.png",
            "caption": "Home2 Page Wirframe"
          },
          {
            "src": "Home3.png",
            "caption": "Home3 Page Wirframe"
          },
          {
            "src": "Home4.png",
            "caption": "Home4 Page Wirframe"
          },
          {
            "src": "Home5.png",
            "caption": "Home5 Page Wirframe"
          }
        ]
      },
      "part2": {
        "title": "Phone Wireframes",
        "description": "These wireframes show consideration of mobile-first designs. (Please Visit the Theory Section for research). Through my research, I found that only necessary information needs to be presented on mobile devices and this means cutting down on content and focusing on how the design needs to change to account for the smaller screen size.",
        "description2": " An example of where this was considered is in the navbar. When the screen has a larger width the “Exploration” button is present, this button acts as a drop down menu for the “cards”, as spoken about above. When the screen size is smaller a drop-down menu makes interaction much more difficult as the text size would need to be smaller to account for the opening of a drop-down menu and a user is still able to access this through the home page “cards”. ",
        "description3": "Another example of mobile-first design is removing the intro paragraph on the video. This is removed on smaller devices as the video width changes and by removing it completely it reduces scroll time from if it were moved to below the video. ",
        "images": [
          {
            "src": "Phone nav.png",
            "caption": "Phone Nav Wireframe"
          },
          {
            "src": "PhoneHome2.png",
            "caption": "Phone Home Page Wireframe"
          }
        ]
      },
      "part3": {},
      "part4": {},
      "part5": {}
    },
    {
      "title": "IXD Process",
      "explanation": " In this section we look at how the user is encouraged to interact and the process that they follow as they navigate the website. ",
      "part1": {
        "title": "Goal Alignment",
        "description": "The overall goal that this website has is to inform and to make learning fun so that the user gains an interest in caring for the ocean. As a designer I need to make this website accessible on different screen sizes because the target audience is not limited to a specific age group. Anyone who is curious about the ocean has something to do on this website. The user's goal is to learn more information about the ocean and engage with the content in a meaningful way."
      },
      "part2": {
        "title": "Infrastructure",
        "description": "The user has a goal which is to answer most of the questions on the quiz page correctly. The user starts off by needing to learn about sea life. The quiz is broken up into separate sections so the user can, for example, learn about sharks and then answer the questions on sharks. The user can navigate back to the pages and learn about a different animal then answer the corresponding questions. To account for this type of user, the quiz not only gives an indication of correct and incorrect attempts but also gives explanations. There is a results page after the quiz that shows the user which questions they correctly/incorrectly answered. ",
        "images": [
          {
            "src": "Content Mapping.png",
            "caption": "This shows the content mapping"
          }
        ]
      },
      "part3": {
        "title": "Userflow",
        "description": "The user starts on the home page, this page creates the need for the user to want to learn more. It shows pollution stats to educate the user on why caring for the ocean is important then it creates interest by showing the user interesting facts. The users are given options of cards to click these cards leading them to separate pages each one on a different sea life. After learning about a specific animal, the user can click the quiz on the nav bar and they can choose which quiz to answer for their chosen sea animal. ",
        "description2": "The navbar is at a fixed position and it indicates at all times to let the user know where they are. The user can easily navigate between pages without relying on memory.",
        "images": [
          {
            "src": "Userflow.png",
            "caption": "This is the userflow"
          }
        ]
      },
      "part4": {
        "title": "Interface Explanation",
        "description": "The interface element is the navbar that allows the user to navigate through different pages and when the screen size is smaller it turns into a burger button. The other interface elements are the buttons on this website. The buttons are used to navigate back to pages, start quizzes, and generate new lists of facts. ",
        "images": []
      },
      "part5": {
        "title": "Style Process",
        "description": "This website is inspired by the websiteOceanInfo.com and all of the reference images below are from this website.",
        "description2": "The aspects of the reference website that is used in this website are the use on icons on facts and the cards on the home pages. The articles are also laid out in a similar manner. ",
        "images": [
          {
            "src": "Referrence1.png",
            "caption": "This is Referrence 1"
          },
          {
            "src": "Referrence3.png",
            "caption": "This is Referrence 2"
          },
          {
            "src": "Referrence2.png",
            "caption": "This is Referrence 3"
          },
          {
            "src": "Referrence4.png",
            "caption": "This is Referrence 4"
          }
        ]
      }
    },
    {
      "title": "Style Guide",
      "explanation": "Although it may not be the most abundant dolphin species on earth, the bottlenose dolphin has made a title for itself as the go-to when someone thinks of a dolphin.",
      "part1": {
        "title": "Goal and Aesthetic",
        "description": "Atlantic, Indian, and Pacific Oceans, warmer tropical and subtropical waters",
        "images": [
          {
            "src": "Home.png",
            "caption": "This is the first image caption"
          },
          {
            "src": "Home.png",
            "caption": "Home Page Wirframe"
          },
          {
            "src": "Home.png",
            "caption": "Home2 Page Wirframe"
          }
        ]
      },
      "part2": {
        "title": "Visual Design",
        "description": "Atlantic, Indian, and Pacific Oceans, warmer tropical and subtropical waters",
        "images": [
          {
            "src": "Home.png",
            "caption": "This is the first image caption"
          },
          {
            "src": "Home.png",
            "caption": "Home Page Wirframe"
          },
          {
            "src": "Home.png",
            "caption": "Home2 Page Wirframe"
          }
        ]
      },
      "part3": {
        "title": "Implementation Notes",
        "description": "Atlantic, Indian, and Pacific Oceans, warmer tropical and subtropical waters",
        "images": [
          {
            "src": "Home.png",
            "caption": "This is the first image caption"
          },
          {
            "src": "Home.png",
            "caption": "Home Page Wirframe"
          },
          {
            "src": "Home.png",
            "caption": "Home2 Page Wirframe"
          }
        ]
      }
    }
  ]
}
