{
  "designContent": [
    {
      "title": "Wireframes",
      "explanation": "I have designed wireframes for both laptop and phone screens. In the images below please note that the text in red is the Visual design element, the green is the Visual Response, and the blue is the Interaction points. These help breakdown the website and its various elements. ",
      "part1": {
        "title": "Website Wireframes",
        "description": "For the Home page, I have slightly varying layouts per section.  The homepage has a video on the top then it has “cards” which are links to blog pages. These blog pages are articles about sea life and how to conserve it. After that is the About Us section which is plain text and not in a bordered box. There is a section called “This is why we care” where pollution statistics are shown, this section has a border. ",
        "description2": "The images on this site have a grid layout (the pictures are next to each other) and when the screen is resized the images are one below each other.",
        "images": [
          {
            "src": "Home.png",
            "caption": "Home Page Wireframe"
          },
          {
            "src": "Home2.png",
            "caption": "Home2 Page Wireframe"
          },
          {
            "src": "Home3.png",
            "caption": "Home3 Page Wireframe"
          },
          {
            "src": "Home4.png",
            "caption": "Home4 Page Wireframe"
          },
          {
            "src": "Home5.png",
            "caption": "Home5 Page Wireframe"
          }
        ]
      },
      "part2": {
        "title": "Phone Wireframes",
        "description": "These wireframes show consideration of mobile-first designs. (Please Visit the Theory Section for research). Through my research, I found that only necessary information needs to be presented on mobile devices and this means cutting down on content and focusing on how the design needs to change to account for the smaller screen size.",
        "description2": " An example of where this was considered is in the navbar. When the screen has a larger width the “Exploration” button is present, this button acts as a drop down menu for the “cards”, as spoken about above. When the screen size is smaller a drop-down menu makes interaction much more difficult as the text size would need to be smaller to account for the opening of a drop-down menu and a user is still able to access this through the home page “cards”. ",
        "description3": "Another example of mobile-first design is removing the intro paragraph on the video. This is removed on smaller devices as the video width changes and by removing it completely it reduces scroll time from if it were moved to below the video. ",
        "images": [
          {
            "src": "Phone nav.png",
            "caption": "Phone Nav Wireframe"
          },
          {
            "src": "PhoneHome2.png",
            "caption": "Phone Home Page Wireframe"
          }
        ]
      },
      "part3": {},
      "part4": {},
      "part5": {}
    },
    {
      "title": "IXD Process",
      "explanation": " In this section we look at how the user is encouraged to interact and the process that they follow as they navigate the website. ",
      "part1": {
        "title": "Goal Alignment",
        "description": "The overall goal that this website has is to inform and to make learning fun so that the user gains an interest in caring for the ocean. As a designer I need to make this website accessible on different screen sizes because the target audience is not limited to a specific age group thus any user with any device can access this website. Anyone who is curious about the ocean has something to do on this website. The user's goal is to learn more information about the ocean and engage with the content in a meaningful way."
      },
      "part2": {
        "title": "Infrastructure",
        "description": "The user has a goal which is to answer most of the questions on the quiz page correctly. The user starts off by needing to learn about sea life. The quiz is broken up into separate sections so the user can, for example, learn about sharks and then answer the questions on sharks. The user can navigate back to the pages and learn about a different animal then answer the corresponding questions. To account for this type of user, the quiz not only gives an indication of correct and incorrect attempts but also gives explanations. There is a results page after the quiz that shows the user which questions they correctly/incorrectly answered. ",
        "images": [
          {
            "src": "Content Mapping.png",
            "caption": "This shows the content mapping"
          }
        ]
      },
      "part3": {
        "title": "Userflow",
        "description": "The user starts on the home page, this page creates the need for the user to want to learn more. It shows pollution stats to educate the user on why caring for the ocean is important then it creates interest by showing the user interesting facts. The users are given options of cards to click these cards leading them to separate pages each one on a different sea life. After learning about a specific animal, the user can click the quiz on the nav bar and they can choose which quiz to answer for their chosen sea animal. ",
        "description2": "The navbar is at a fixed position and it indicates at all times to let the user know where they are. The user can easily navigate between pages without relying on memory.",
        "images": [
          {
            "src": "Userflow.png",
            "caption": "This is the userflow"
          }
        ]
      },
      "part4": {
        "title": "Interface Explanation",
        "description": "The interface element is the navbar that allows the user to navigate through different pages and when the screen size is smaller it turns into a burger button. The other interface elements are the buttons on this website. The buttons are used to navigate back to pages, start quizzes, and generate new lists of facts. ",
        "images": []
      },
      "part5": {
        "title": "Style Process",
        "description": "This website is inspired by the websiteOceanInfo.com and all of the referrence images below are from this website.",
        "description2": "The aspects of the reference website that is used in this website are the use on icons on facts and the cards on the home pages. The articles are also laid out in a similar manner. ",
        "images": [
          {
            "src": "Referrence1.png",
            "caption": "This is Referrence 1"
          },
          {
            "src": "Referrence3.png",
            "caption": "This is Referrence 2"
          },
          {
            "src": "Referrence2.png",
            "caption": "This is Referrence 3"
          },
          {
            "src": "Referrence4.png",
            "caption": "This is Referrence 4"
          }
        ]
      }
    },
    {
      "title": "Style Guide",
      "explanation": "In this section, we will look at the goals of the website and visual designs. We will unpack fonts and color choices.",
      "part1": {
        "title": "Goal and Aesthetic",
        "description": "Creates a sense of immersion and exploration, aligning with the interactive learning aspect",
        "images": []
      },
      "part2": {
        "title": "Font Choices",
        "description": "Poppins font is used for the majority of the content on this website and Dream Outland Pro is used for smaller headings for some sections ",
        "description2": "Poppins font was chosen since Sans-serif fonts like Poppins are generally considered easier to read on screens compared to serif fonts. It is also a well-balanced sans-serif font that works well for both headings and body text thus versatility was a factor in this choice.",
        "description3": "Dreamland Pro is a display font, and these fonts are often chosen for headings because they can add a touch of personality and interest. Dreamland Pro's playful style might be intended to make the learning experience more engaging, especially for younger audiences.",
        "images": []
      },
      "part3": {
        "title": "Implementation Notes",
        "description": "In order to implement the process in the image below, I had to break up each box into its own script and then I had to break it down further. An example of this was that for the cards I called each Json data in its own script then I brought all those components into an InfoCard.jsx file. This makes work more manageable and readable for the next time I have to return to this code.",
        "images": []
      },
      "part4": {
        "title": "Visual Design",
        "description": "This website uses svgs waves  which correlates with the ocean theme while also  giving the website a more playful look. This wave theme is used frequently and is shown by the animated footer that looks like waves moving across the screen.Another aspect of this wave theme used in this website is in the responsive navbar. When the screen size is smaller how the background of the navbar opening emulates a wave that is swiping across the screen. ",
        "description2": "The colour palette chosen for this website is a lighter blue and white background which fits with the ocean theme and it works well with the images which are of sea life the have some blues in the background. ",
        "description3": " Light blue evokes shallows, dark blue represents depths, white provides clean background, and black adds contrast.",
        "images": [
          {
            "src": "colourChoices.png",
            "caption": "Colour Choices"
          }
        ]
      }
    },
    {
      "title": "Feedback- Information Architecture  ",
      "explanation": "Information structure is one area that I needed to work on for this website and it has 3 elements",
      "part1": {
        "title": "Organization",
        "description": "This refers to the logic of the structure of the website (Why are elements placed in certain positions? Is it a good design choice -Are the elements related? How will placement affect interaction?). This looks at how a designer can create a clear path for users to navigate the website. ",
        "images": []
      },
      "part2": {
        "title": "Structure",
        "description": "This looks at how the content is laid out and how this guides the user. ",
        "images": [
          {
            "src": "IA.png",
            "caption": "Information Architecture"
          }
        ]
      },
      "part3": {
        "title": "Labeling",
        "description": "Refers to the buttons and titles on the page and how they influence the user interaction. ",
        "images": [
          {
            "src": "InformationArchitecture_thumb.jpg",
            "caption": "Information Architecture"
          }
        ]
      },
      "part4": {
        "title": "What changed?",
        "description": "Areas that I improved on concerning Information Architecture are mostly in the design section. It followed a similar layout to the rest of the website’s blogs; however, it contains more than twice the amount of content and it involves multiple areas of interest. This meant that it needed a different design, I decided to replace the layout which had all the blogs one after the other and replace them with cards similar to the home page. These cards had a heading for which section they direct the user to and a short description. When the user clicks on a card it alters the page to show them the specific “blog” that they have requested. To help the user know where to proceed there is a back button and a next button that the user is able to navigate through the blog list in the design section. This makes the information in the design section easier to digest as the user is presented with smaller chunks of information. ",
        "description2": "Reference: Hannah, J. (2023). What is information architecture? - UX Design Institute. [online] www.uxdesigninstitute.com. Available at: https://www.uxdesigninstitute.com/blog/what-is-information-architecture/.",
        "images": []
      }
    },
    {
      "title": "Feedback- ‌User Interface Design  ",
      "explanation": "It is the point of contact between humans and computers. Design affect the look and feel of the website.  ",
      "part1": {
        "title": "",
        "description": "This involves the clarity of communication with the user. ",
        "images": [
          {
            "src": "ui.png",
            "caption": "UI Process"
          }
        ]
      },
      "part2": {
        "title": "",
        "description": "An example is a button, although they come in many designs, simple style tells the user that it is something that can be interacted with. This is in the form of hover effects with changes in text weight, background colours and borders. Manipulating this element to show the user that this component on a website is a button and it gives them visual feedback and makes the website look more lively. The buttons previously on this website weren’t as easy identifiable like in the image below ",
        "description2": "Reference: Coursera. (n.d.). What Is UI Design? Definition, Tips, Best Practices. [online] Available at: https://www.coursera.org/articles/ui-design.",
        "images": [
          {
            "src": "button.png",
            "caption": "Previous Button styles"
          }
        ]
      },
      "part3": {
        "title": "Button Breakdown",
        "description": "",
        "images": [{ "src": "buttonstyle.png", "caption": "Button styles" }]
      },
      "part4": {
        "title": "",
        "description": " ",
        "images": []
      }
    },
    {
      "title": "Feedback- Visual Design",
      "explanation": "‌For the visual design, a few principles need to be considered.",
      "part1": {
        "title": "Balance",
        "description": "One principle is Balance which looks at the visual weight and how it is distributed across the screen. ",
        "images": []
      },
      "part2": {
        "title": "Contrast",
        "description": "The next principle is Contrast which looks at color and brightness. Contrast helps the user break up the web page into sections. ",
        "images": []
      },
      "part3": {
        "title": "Alignment",
        "description": "The last principle is Alignment which creates a sense of order. This is where I have struggled since sometimes text needs to be centered or slightly offset and it has been difficult to know when to use different alignments. ",
        "images": []
      },
      "part4": {
        "title": "Other Visual Design Principles",
        "description": " ",
        "images": [
          {
            "src": "vis.png",
            "caption": "Visual Design Principles"
          }
        ]
      }
    },
    {
      "title": "Feedback- Consistent Designs ",
      "explanation": "Consistency in web design creates a uniform appearance, feel, and usability across all pages of a website and it shouldn't be overlooked. ",
      "part1": {
        "title": "",
        "description": "‌In order to make this website more immersive and to create a flow I needed to implement more consistent designs. I did this by adding the svg waves from the home page to every page on the website and I styled all the buttons in the same manner. This helps with setting up the user's expectations of behavior. Since the user knows that when they see the button design on an element it is something that they can click, and they will get some response from the site. Another way that I created a consistent design is the use of cards from the home page. However I tailored it to the design section and used text and buttons instead of text and images, but every other aspect of its design is the same. ",
        "images": [
          {
            "src": "consis.png",
            "caption": "Design Consistency"
          }
        ]
      },
      "part2": {
        "title": "",
        "description": "",
        "images": [
          {
            "src": "consis2.png",
            "caption": "Design Consistency"
          }
        ]
      },
      "part3": {
        "title": "",
        "description": "",
        "images": [
          {
            "src": "consis3.png",
            "caption": "Design Consistency"
          }
        ]
      },
      "part4": {
        "title": "",
        "description": " ",
        "images": []
      }
    },
    {
      "title": "Feedback- Typography  ",
      "explanation": "Typography design is an essential part of any visual communication.This is because is informs hierachy and structure in a website.",
      "part1": {
        "title": "",
        "description": "As discussed in a previous blog I struggle with creating order through typography so I found an article that breaks down various tools and methods to overcome this. Below is an image that in my opinion is a great analysis for typography.   ",
        "images": []
      },
      "part2": {
        "title": "",
        "description": "This article poses important questions that one needs to answer when designing a web page. “What message are we trying to convey?” “What do users need to know first? Which elements deserve the most attention?”. This helps me identify which elements are important so that appropriate styling is applied. Then the designer needs to consider how will the user navigate , what are their options and what do they see.",
        "images": [
          {
            "src": "type.png",
            "caption": "Typography Description"
          }
        ]
      },
      "part3": {
        "title": "Elements",
        "description": "There are a few elements that when utilized correctly create an overall appealing design .The first is colour , it is important to note that even if a designer is using one colour they can use different shade of that colour which create “layers” In the information presented to a user. The next element is weight, making text bold creates a hierarchy. Sometimes it is also beset not to use too many different sizes of text and to use weight as a form of creating a hierarchy Spacing in terms of margins and line height creates whitespace that sometimes helps create clarity and even emphasis. Headings need to be bold and larger than the body, it needs to be at least x 2 the body text size. Headings also require line spacing which gives it “breathability”. Subheadings should be at least 1.5x  the body text size and it can’t be as bold as the main heading. Body text should have the highest contrast from the background and the front must be clean and legible. ",
        "images": []
      },
      "part4": {
        "title": "",
        "description": "This article gave me a good framework to use and it feels like a valuable find since there are many UX trends but typography is something that is always applicable.",
        "description2": "Reference: Mondragon, M. (2024). Typography in Design: A Comprehensive Guide. [online] Medium. Available at: https://medium.com/@mondragondesign/typography-in-design-a-comprehensive-guide-74e1ba762d14 [Accessed 13 Jun. 2024]. ",
        "images": []
      }
    },
    {
      "title": "New Content",
      "explanation": "These are the latest additions to this website and certain decisions were made.",
      "part1": {
        "title": "Cards in Design Section",
        "description": " I have changed quite a few areas on this website. Most of the changes that I have made have been prompted by the feedback that I received in assignment 3 , the rest is due to research. To elebaroate on this, I have added another article and I have made quiz questions for it as well . This makes the cards in the home page feel complete . This is because it holds three cards next to each other. I previously only had 5 cards , this  left an empty space and gave an incomplete feeling . Also how can this website claim to be about the ocean and not include anything about fish. The article tahta I chose to add is on cute fish . This fist in with the goal of the website which is to educate and make learning fun – the articles on sea life are all eye catching articles that compare and inform in an esay to digets manner.  ",
        "images": [
         
        ]
      },
      "part2": {
        "title": "",
        "description": "",
        "images": []
      },
      "part3": {
        "title": "Themes",
        "description": "The next area that was improved on is the dark and light mode addition. There are many advantages to including a theme selector on a website , the most important being that it increases accessibility. Bright screens affect some users that are sensitive to light and this bright website may deter them. Also when user opens websites at night they prefer to use dark modes as it is easy on the eyes. This allows for more traffic on the website at all times of day. I have also made sure to save the user's preference using local storage and content. This means that when a user is on the home page and chooses a theme and they move on to another page it saves their choice. Without this is found that it creates a frustrating experience as the users eyes gets used to one choices and then when hey switch a page their eyes have to quickly adjust. It is best to save the preferences so that even when they visit the websites later the website is set to their liking. ",
        "images": []
      },
      "part4": {
        "title": "",
        "description": " ",
        "images": []
      }
    }
  ]
}
