{
  "sections": [
    {
      "title": "Marine Life Threats",
      "content": [
        "Marine life faces a significant threat thanks to overfishing. Of course, there are laws trying to reduce overfishing and dragnet usage (both of which have a horrific impact), but there are also issues of the nets themselves. When a net stops being useful, it should legally be recycled. But because of the type of plastic that nets are made from, there are only two machines in Europe that can effectively do this. As a consequence, the cost of disposing of nets ethically is far more than most individual fishermen and even larger industrial fishing operations are prepared to pay."
      ]
    },
    {
      "title": "Marinas and Boatyards",
      "subsections": [
        {
          "title": "How they harm beaches",
          "content": [
            "Boating and marinas harm beaches by contributing to water pollution and habitat destruction."
          ]
        },
        {
          "title": "What can you do",
          "content": [
            "We can promote clean boating practices and use environmentally friendly products for maintenance."
          ]
        },
        {
          "title": "Impact on Beaches",
          "content": [
            "Boating and marinas can impact beaches in several ways:",
            "Water Quality Issues: The cumulative release of pollutants from individual boats and marinas can lead to water pollution, including high toxicity levels, increased concentrations of pollutants in aquatic organisms and sediments, and elevated nutrient levels that promote algae growth and decrease oxygen levels (eutrophication).",
            "Erosion and Habitat Destruction: The construction and operation of marinas can physically alter shorelines, wetlands, and aquatic habitats, leading to increased erosion rates and destruction of sensitive ecosystems and bottom-dwelling aquatic communities.",
            "Pathogens and Contaminants: Discharge of sewage from boats, stormwater runoff from marina parking lots, and alteration of shoreline habitats can introduce pathogens and contaminants into coastal waters, posing risks to aquatic life and public health.",
            "Chemical Pollution: Boat maintenance activities, such as cleaning and painting, can release chemicals and metals into the water, including solvents, paint, oil, and antifouling paint containing harmful substances like chlorine, ammonia, and phosphates. Small oil spills from motors and refueling activities can also introduce petroleum hydrocarbons into aquatic ecosystems, harming marine organisms and ecosystems."
          ]
        },
        {
          "title": "Spill Risks",
          "content": [
            "Chemicals used on boats, such as oils, paints, and cleansers, may spill into the water."
          ]
        }
      ]
    },
    {
      "title": "Igniting the Beacon of Hope",
      "content": [
        "Obviously, it is quite difficult to have an effect on what corporations do and on the fishing industry. We can change legislation as an individual, lobby, or by running a campaign, but there is no guarantee we will be successful. If we want to go a step further, we can try and enter into the world of politics, but once again, the chances of this leading to anything are slim. However, some things can be done."
      ]
    },
    {
      "title": "Reduce Our Waste",
      "content": [
        "Most supermarkets butchers will allow you to use your own packaging in order to avoid prepackaged vegetables that are often packed extraneously. Recycling your carrier bags is such a small step, but the implementation of a 5 cent fee on all plastic bags has led to a significant reduction in plastic bag use. Also, it’s helpful to choose paper instead of plastics because approximately 90% of floating marine debris is plastic and every year, nearly 10 million tons of plastic end up on beaches worldwide."
      ],
      "subsections": [
        {
          "title": "Plastic Bag Impacts",
          "content": [
            "Plastic bags look like jellyfish and block the digestive tracts of sea turtles."
          ]
        }
      ]
    },
    {
      "title": "Provide Nature-Based Solutions",
      "content": [
        "Nature-Based Solutions (NbS) are solutions 'which aim to help societies address a variety of environmental, social and economic challenges in sustainable ways, including actions which are inspired by, supported by or copied from nature. NbS use the features and complex system processes of nature, such as its ability to store carbon and regulate water flow, in order to achieve desired outcomes, such as reduced disaster risk, improved human well-being and socially inclusive green growth'.",
        "European Commission’s Directorate General for Research and Innovation",
        "Around the world, various methods are used to protect beaches. In the U.S., the government has allocated approximately $9 billion for sand re-nourishment projects, where sand is dumped onto eroded beaches. While effective temporarily, this approach is costly and not sustainable, especially with climate change worsening the problem. Hard infrastructure like sea walls as sand retention structures is also used but can transfer risks and be visually unappealing.",
        "Recently, natural solutions like coral reef restoration and sand and dune restoration have been explored. These Nature-based Solutions (NbS) not only protect against erosion but also provide additional benefits, such as coral reefs can dissipate up to 97% of incident wave energy and provide revenue-generating opportunities associated with snorkeling, diving, fishing, aquarium trade, and more. While there is no one-size-fits-all solution, NbS offers innovative approaches to coastal protection."
      ]
    },
    {
      "title": "Fill Any Dug Holes at the Beach",
      "content": [
        "Before departing, ensure to fill any dug holes at the beach. Although constructing sandcastles and digging moats is enjoyable, leaving holes poses obstacles for beach-dwelling animals. Large holes are particularly hazardous for sea turtles nesting at night. In addition to filling holes, remember to remove any equipment, such as chairs or umbrellas, which could potentially entangle and harm seaside wildlife."
      ],
      "subsections": [
        {
          "title": "Biodiversity Importance",
          "content": [
            "From seagrass beds to nesting sea turtles, beaches are hubs of biodiversity."
          ]
        }
      ]
    },
    {
      "title": "Use Reusable Eco-Friendly Products",
      "content": [
        "Use reusable items like water bottles, food containers, utensils, and bags to minimize the use of single-use plastics at the beach. Pack your snacks and beverages in reusable containers, and steer clear of plastic wrappers that can easily be blown away by the ocean breeze."
      ]
    },
    {
      "title": "Uniting for a Common Cause",
      "content": [
        "The power to effect change lies within our communities. By participating in beach cleanups and supporting local conservation initiatives, individuals can forge a path towards a cleaner, more sustainable future."
      ]
    },
    {
      "title": "How You Can Get Involved",
      "content": [
        "Fortunately, you can be a part of correcting that problem. Causes like The Great British Beach Clean help people come together and help keep our beaches clean. Their helpers consist of a mix of volunteers and school-age children who might be studying conservation and the environment or simply have a passion for helping their local seaside. Thousands of people take part in events like this every year, and there are numerous like it around the world happening throughout the year.",
        "A Google search should help you ascertain if there is a beach clean organized for your area. But if there isn’t one, they are simple to organize yourself. The Marine Conservation Society is one organization that runs similar projects, and they have all the details one would need on their website. Support how organizations like Corona along with Oceanic Global is taking action for 80% of plastic that comes from land-based sources. To address this, they conduct high-impact cleanups of America’s most polluted beaches. Boca Save Our Beaches is another similar non-profit organization. These organizations have coastal scientists working for the cause. Organizing an event is a great way to contribute to one’s community and improve the environment."
      ]
    },
    {
      "title": "Save San Clemente’s Beaches",
      "content": [
        "State Beach and North Beach face imminent danger as OCTA proposes the installation of $200 million worth of rock revetments along the shoreline. These plans involve extending the revetments up to 125 feet seaward of the railroad, mirroring previous actions where $8 million was spent at the south end of town. The railroad’s hard armoring of our shoreline disrupts the natural flow and accumulation of beach sand, exacerbating coastal erosion. Similar measures are anticipated for the south end of North Beach, extending through Linda Lane. Join different petitions and organizations to save our beaches and bring back our beaches."
      ],
      "subsections": [
        {
          "title": "Community Involvement",
          "content": [
            "Save Our Beaches organization conducts a beach cleanup on a monthly basis and held California Coastal Cleanup Day as a collaborative event. Steve Masoner was honored as Seal Beach’s 'Citizen of the Year' during the Annual Cypress College Americana Awards. Our Board of Directors educate individuals, companies, schools & organizations on how their environmental footprint impacts their community and the world by participating in Save Our Beach beach cleanups."
          ]
        }
      ]
    }
  ]
}
